{"pageProps":{"slug":"js-os-awards-2022-overview","blog":{"author":"Gao","content":"## Breakthrough of the Year\nA project that contributes to the JavaScript ecosystem and adds new dimensions and possibilities for further development. New concepts and ideas with excellent first realization and huge future potential.\n\n### Solid\nA declarative, efficient, and flexible JavaScript library for building user interfaces.\nhttps://github.com/solidjs/solid\n\nSolid is a declarative JavaScript library for creating user interfaces. Instead of using a Virtual DOM, it compiles its templates to real DOM nodes and updates them with fine-grained reactions. Declare your state and use it throughout your app, and when a piece of state changes, only the code that depends on it will rerun. \n\n\n### Hoppscotch\nOpen source API development ecosystem.\nhttps://github.com/hoppscotch/hoppscotch\n\nRun with\n```bash\ndocker run --rm --name hoppscotch -p 3000:3000 hoppscotch/hoppscotch:latest\n```\n\n\n### Web3.js\nEthereum JavaScript API\nhttps://github.com/ChainSafe/web3.js\n\nThis is the Ethereum  [JavaScript API](http://web3js.readthedocs.io/)  which connects to the  [Generic JSON-RPC](https://github.com/ethereum/wiki/wiki/JSON-RPC)  spec.\nYou need to run a local or remote  [Ethereum](https://www.ethereum.org/)  node to use this library.\n\n\n## The Most Exciting Use of Technology\nUnique and unconventional use of JavaScript: a mix of original software and technologies that make the language shine and boost the development.\n\n### Partytown\nRelocate resource intensive third-party scripts off of the main thread and into a web worker.\nhttps://github.com/BuilderIO/partytown\n\nPartytown is a lazy-loaded library to help relocate resource intensive scripts into a  [web worker](https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API) , and off of the  [main thread](https://developer.mozilla.org/en-US/docs/Glossary/Main_thread) . Its goal is to help speed up sites by dedicating the main thread to your code, and offloading third-party scripts to a web worker.\n\nThe philosophy is that the main thread should be dedicated to your code, and any scripts that are not required to be in the  [critical path](https://developers.google.com/web/fundamentals/performance/critical-rendering-path)  should be moved to a web worker. Main thread performance is, without question, more important than web worker thread performance.\n\n\n### vanilla-extract\nZero-runtime Stylesheets-in-TypeScript.\nhttps://github.com/seek-oss/vanilla-extract\n\nWrite your styles in TypeScript (or JavaScript) with locally scoped class names and CSS Variables, then generate static CSS files at build time.\n\nBasically, it’s  [“CSS Modules](https://github.com/css-modules/css-modules) -in-TypeScript” but with scoped CSS Variables + heaps more.\n\n\n### tRPC\nEnd-to-end typesafe APIs made easy.\nhttps://github.com/trpc/trpc\n\ntRPC allows you to easily build & consume fully typesafe APIs, without schemas or code generation.\n\nThis is a full stack type system used in next.js.\n\n### zx\nA tool for writing better scripts.\nhttps://github.com/google/zx\n\nBash is great, but when it comes to writing more complex scripts, many people prefer a more convenient programming language. JavaScript is a perfect choice, but the Node.js standard library requires additional hassle before using. The zx package provides useful wrappers around child_process, escapes arguments and gives sensible defaults.\n\n### Q.js\nQuantum computing in your browser.\nhttps://github.com/stewdio/q.js\n\n**Quantum, made easy.**\n\nQ is a quantum circuit simulator, drag-and-drop circuit editor, and powerful JavaScript library that runs right here in your web browser. There’s nothing to install and nothing to configure, so jump right in and experiment! Fire up the  [Q editor](https://quantumjavascript.app/) , then tap and drag the pieces around to get a feel for how it works. It’s easy to use on both desktop and mobile devices. Made a mistake? Just tap the Undo button.\n\n\n### Tauri\nBuild smaller, faster, and more secure desktop applications with a web frontend.\nhttps://github.com/tauri-apps/tauri\n\n**Introduction**\n\nTauri is a framework for building tiny, blazingly fast binaries for all major desktop platforms. Developers can integrate any front-end framework that compiles to HTML, JS and CSS for building their user interface. The backend of the application is a rust-sourced binary with an API that the front-end can interact with.\n\nThe user interface in Tauri apps currently leverages  [tao](https://docs.rs/tao)  as a window handling library on macOS and Windows, and  [gtk](https://gtk-rs.org/docs/gtk/)  on Linux via the **Tauri-team** incubated and maintained  [WRY](https://github.com/tauri-apps/wry) , which creates a unified interface to the system webview (and other goodies like Menu and Taskbar), leveraging WebKit on macOS, WebView2 on Windows and WebKitGTK on Linux.\n\n\n## Fun Side Project of the Year\nFun projects that would make you go “wow”, without specific purpose or logic, but interesting and entertaining.\n\n### Gaze Detection\nUse machine learning in JavaScript to detect eye movements and build gaze-controlled experiences.\nhttps://github.com/charliegerard/gaze-detection\n\nUses Tensorflow.js's  [face landmark detection model](https://www.npmjs.com/package/@tensorflow-models/face-landmarks-detection) .\n\nThis tool detects when the user looks right, left, up and straight forward.\n\n\n### Big Heads\nEasily create characters for your projects.\nhttps://github.com/RobertBroersma/bigheads\n\nGenerate avaters as a react component with a list of settings.\n\n\n### Ossart\nPrint your GitHub activity as an artwork.\nhttps://github.com/djyde/ossart\n\nThis is a tool to generate your GitHub activity as an artwork. You can generate a near 6 years contribution map by any username, and then print it to an A4 paper and wrap it in a photo frame you bought yourself.\n\n\n### Yoha\nA practical hand tracking engine.\n[GitHub - RobertBroersma/bigheads: Easily create characters for your projects](https://github.com/RobertBroersma/bigheads)\n\nYoha is a hand tracking engine that is built with the goal of being a versatile solution in practical scenarios where hand tracking is employed to add value to an application. While ultimately the goal is to be a general purpose hand tracking engine supporting any hand pose, the engine evolves around specific hand poses that users/developers find useful.\n\n\n## The Most Impactful Contribution\nProjects that contribute the most to the development and growth of the community.\n\n### pnpm\nFast, disk space efficient package manager.\nhttps://github.com/pnpm/pnpm\n\nAlready used in work.\n\n### Three.js journey\nGet good at Three.js with only one course.\nhttps://threejs-journey.com/#\n\nStart Learning with $95. 😄\n\n\n### Dev for Ukraine\nDevs For Ukraine was a free, online engineering conference with the goal to raise funds and provide support to Ukraine.\nhttps://www.devsforukraine.io/\n\nDevs For Ukraine was a free, online engineering conference with the goal to raise funds and provide support to Ukraine. 🇺🇦\n\n\n### Medusa\nThe open-source Shopify alternative.\nhttps://github.com/medusajs/medusa\n\nMedusa is an open source composable commerce engine built with Node.js. Medusa enables developers to build scalable and sophisticated commerce setups with low effort and great developer experience.\n\n\n### Bytes.dev\nThe Best JavaScript Newsletter.\nhttps://bytes.dev/\n\nStaying informed on the JavaScript ecosystem has never been so entertaining. Delivered every Monday and Thursday, for free.\n\n\n## Productivity Booster\nThe best projects that improve the efficiency of the development work.\n\n### Omni\nThe all-in-one tool to supercharge your productivity.\nhttps://github.com/alyssaxuu/omni\n\nThe most powerful interface for your browser 🔥\n\nWith Omni you can use your browser like a pro. Manage tabs, bookmarks, your browser history, perform all sorts of actions and more with a simple command interface.\n\nBrowser plugin like Alfred in macOS.\n\n\n### Amplication\nAmplication auto-generates backend apps built with TypeScript and Node.js, and a client built with React.\nhttps://github.com/amplication/amplication\n\nAmplication  is an open‑source development platform. It helps professional Node.js developers build quality Node.js applications without spending time on repetitive coding tasks.\n\nAmplication provides the following features:\n* Production-ready APIs\n* Data Model\n* Role Based Access Control (RBAC)\n* Microservices Support\n* Continuous GitHub Sync\n* TypeScript and Node.js Source Code\n* Plugin System\n* Monorepo or Polyrepo\n* Custom Code\n* Admin UI\n* Amplication Console & CLI\n\n\n### Zod\nTypeScript-first schema validation with static type inference.\nhttps://github.com/colinhacks/zod\n\nZod is a TypeScript-first schema declaration and validation library. I’m using the term “schema” to broadly refer to any data type, from a simple string to a complex nested object.\n\nZod is designed to be as developer-friendly as possible. The goal is to eliminate duplicative type declarations. With Zod, you declare a validator *once* and Zod will automatically infer the static TypeScript type. It’s easy to compose simpler types into complex data structures.\n\nSome other great aspects:\n* Zero dependencies\n* Works in Node.js and all modern browsers\n* Tiny: 8kb minified + zipped\n* Immutable: methods (i.e. .optional()) return a new instance\n* Concise, chainable interface\n* Functional approach:  [parse, don’t validate](https://lexi-lambda.github.io/blog/2019/11/05/parse-don-t-validate/) \n* Works with plain JavaScript too! You don’t need to use TypeScript.\n\n\n### Hardhat\nHardhat is a development environment to compile, deploy, test, and debug your Ethereum software.\nhttps://github.com/NomicFoundation/hardhat\n\nHardhat is an Ethereum development environment for professionals. It facilitates performing frequent tasks, such as running tests, automatically checking code for mistakes or interacting with a smart contract. Check out the  [plugin list](https://hardhat.org/plugins/)  to use it with your existing tools.\n\n\n","date":"2022-11-17","id":82,"slug":"js-os-awards-2022-overview","title":"JavaScript OS Awards 2022 Overview"},"lightCss":"pre code.hljs{display:block;overflow-x:auto;padding:1em}code.hljs{padding:3px 5px}.hljs{color:#383a42;background:#fafafa}.hljs-comment,.hljs-quote{color:#a0a1a7;font-style:italic}.hljs-doctag,.hljs-formula,.hljs-keyword{color:#a626a4}.hljs-deletion,.hljs-name,.hljs-section,.hljs-selector-tag,.hljs-subst{color:#e45649}.hljs-literal{color:#0184bb}.hljs-addition,.hljs-attribute,.hljs-meta .hljs-string,.hljs-regexp,.hljs-string{color:#50a14f}.hljs-attr,.hljs-number,.hljs-selector-attr,.hljs-selector-class,.hljs-selector-pseudo,.hljs-template-variable,.hljs-type,.hljs-variable{color:#986801}.hljs-bullet,.hljs-link,.hljs-meta,.hljs-selector-id,.hljs-symbol,.hljs-title{color:#4078f2}.hljs-built_in,.hljs-class .hljs-title,.hljs-title.class_{color:#c18401}.hljs-emphasis{font-style:italic}.hljs-strong{font-weight:700}.hljs-link{text-decoration:underline}","darkCss":"pre code.hljs{display:block;overflow-x:auto;padding:1em}code.hljs{padding:3px 5px}.hljs{color:#abb2bf;background:#282c34}.hljs-comment,.hljs-quote{color:#5c6370;font-style:italic}.hljs-doctag,.hljs-formula,.hljs-keyword{color:#c678dd}.hljs-deletion,.hljs-name,.hljs-section,.hljs-selector-tag,.hljs-subst{color:#e06c75}.hljs-literal{color:#56b6c2}.hljs-addition,.hljs-attribute,.hljs-meta .hljs-string,.hljs-regexp,.hljs-string{color:#98c379}.hljs-attr,.hljs-number,.hljs-selector-attr,.hljs-selector-class,.hljs-selector-pseudo,.hljs-template-variable,.hljs-type,.hljs-variable{color:#d19a66}.hljs-bullet,.hljs-link,.hljs-meta,.hljs-selector-id,.hljs-symbol,.hljs-title{color:#61aeee}.hljs-built_in,.hljs-class .hljs-title,.hljs-title.class_{color:#e6c07b}.hljs-emphasis{font-style:italic}.hljs-strong{font-weight:700}.hljs-link{text-decoration:underline}"},"__N_SSG":true}