{"pageProps":{"slug":"memory-rank","blog":{"author":"Gao","content":"最近打算把服务器的内存补充上，看了一下服务器内存，发现内存有两种，一种是1Rx8一种是2Rx4的，为了避免内存不兼容，去看了一下相关的技术文档。\n\n找到了一篇镁光的文章 [What is a Memory Rank?](https://www.crucial.com/support/articles-faq-memory/what-is-a-memory-rank)\n\nThe term rank was created by JEDEC, the memory industry’s standards group, to distinguish between the number of memory banks on a module as opposed to the number of memory banks on a component, or memory chip. The concept of memory rank applies to all memory module form factors, though in general it tends to matter primarily on server platforms, due to the larger amounts of memory they manage.\n\n技术术语 `rank` 是由JEDEC创建，内存工业标准组，用于区分模块上的内存条数量与组件或内存芯片上的内存条数量。\n内存排列的概念适用于所有内存模块因素，尽管通常它往往主要在服务器平台上很重要，因为它们管理的内存量更大。\n\nA memory rank is a block or area of data that is created using some, or all, of the memory chips on a module. A rank is a data block that is 64 bits wide. On systems that support Error Correction Code (ECC) an additional 8 bits are added, which makes the data block 72 bits wide. Depending on how a memory module is engineered, it may have one, two, or four blocks of 64-bit wide data areas (or 72-bit wide in the case of ECC modules.) This is referred to as single-rank, dual-rank, and quad-rank. Crucial denotes this on the module label as 1Rx4, or 2Rx4, 2Rx8, or similar.\n\n内存排列是内存模块上的部分或全部内存芯片创建的数据块或区域。\n排列是 64bit 宽的数据块。在支持自动纠错 (ECC) 的系统上，额外添加了 8bit ，数据块为 72bit 宽。\n根据内存模块的设计方式，它可能有一个、两个或四个 64bit 宽数据区（或 ECC 模块为 72bit 宽）。\n这被称为 single-rank, dual-rank, and quad-rank.。 \nCrucial 在模块标签上将此表示为 1Rx4、或 2Rx4、2Rx8 或类似名称。\n\nThe x4 and x8 refer to the number of banks on the memory component or chip. It is this number, not the number of individual memory chips on a PCB, that determines the rank of the finished module. In other words, if a module has chips on both sides of the PCB, which makes it dual-sided, it can still be single-ranked, dual-ranked, or quad-ranked, depending on how those chips are engineered.\n\nx4 和 x8 是指内存组件或芯片上的存储体数量。正是这个数字，而不是 PCB 上单个内存芯片的数量，决定了成品模块的等级。\n换句话说，如果一个模块在 PCB 的两面都有芯片，这使得它是双面的，它仍然可以是单排、双排或四排，这取决于这些芯片的设计方式。\n\nBecause a rank is 64 or 72 bits, an ECC module made from x4 chips will need eighteen chips for one single rank (18 x 4 = 72). An ECC module made from x8 chips needs only nine of them for a rank (9 x 8 = 72). A module made from eighteen x8 chips would be dual-ranked (18 x 8 = 144, 144/72 = 2). An ECC module that has twice as many x8 chips becomes quad-ranked (36 x 8 = 288, 288/72 = 4). \n\n因为一个等级是 64 或 72 位，一个由 x4 芯片制成的 ECC 模块将需要 18 个芯片来实现一个单一的等级 (18 x 4 = 72)。\n由 x8 芯片制成的 ECC 模块只需要其中的 9 个即可获得一个等级 (9 x 8 = 72)。\n由 18 个 x8 芯片制成的模块将是双列 (18 x 8 = 144, 144/72 = 2)。\n具有两倍 x8 芯片数量的 ECC 模块变为四阶 (36 x 8 = 288, 288/72 = 4)。\n\nHaving a dual- or quad-ranked module is like having two or four DRAM modules combined onto one module. For example, you can instantly go from four single rank 4GB RDIMM modules to a single quad-rank 16GB RDIMM module (assuming the system is compatible with 16GB RDIMMs).\n\n拥有双排或四排模块就像将两个或四个 DRAM 模块组合到一个模块上。\n例如，您可以立即从四个单列 4GB RDIMM 模块转换为单个四列 16GB RDIMM 模块（假设系统与 16GB RDIMM 兼容）。\n\nThe drawback with higher ranked modules is that servers sometimes have a limit on how many ranks they can address. For example, a server with four memory slots may be limited to a total of eight ranks. This means you can install four single-ranked modules or four dual-ranked modules but only two quad-ranked modules, as installing more would exceed the amount of ranks that can be addressed.\n\n较高等级模块的缺点是服务器有时对它们可以处理的等级数有限制。\n例如，具有四个内存插槽的服务器可能限制为总共八个列。\n这意味着您可以安装四个单列模块或四个双列模块，但只能安装两个四列模块，因为安装更多模块会超过可以处理的列数。\n\nOn matters of rank and rank limitations, we recommend that you consult the manufacturer’s documentation for guidelines and directions that apply to your specific system. Additional information on ranking and the systems it typically applies to can be found here.\n\n关于等级和等级限制的问题，我们建议您查阅制造商的文档，了解适用于您的特定系统的指南和说明。可以在此处找到有关排名及其通常适用的系统的其他信息。\n\n\n\n","date":"2021-11-25","id":56,"slug":"memory-rank","title":"什么是内存排列（memory rank）？"}},"__N_SSG":true}